help_message = """Дробові числа лише через точку!
Просто нажми на відповідь щоб скопіювати її
Вводити потрібно лише маленькі літери
Константи рі, е вводяться ангійською мовою

Для перегляду всього функціоналу тисни /all_functions
Якщо є дужки, то треба писати в дужках
"""

all_functions = '''Весь функціонал:
3амість х, у підставляються власні числа
3начком \#\# вказані функції, які не працюють, але за необіхдності будуть добавлені

`x\+y` додавання
`x\-y` віднімання
`x/y` або `x÷y` ділення
`x\*y` множення
\#\#`//` цілочисельне ділення \(ділення без остачі\)
`x%y` остаток від ділення
`x^y` або `x\*\*y` степінь
`sqrt\(x\)` корінь квадратний
`root\(x, y\)` корнь будь\-якої степені, x\-степінь кореня, y\-аргумент кореня\
\(але root\(\) всередині root\(\) не обрахується\)
`pow(x, y)` піднесення х до степеня у

`sin\(x rad\)` або `sin\(x\)` синус в радіанах
`sin\(x deg\)` синус в градусах
`cos\(x rad\)` або `cos\(x\)` косинус в радіанах
`cos\(x deg\)` косинус в градусах
`tan\(x rad\)` або `tan\(x\)` тангенс в радіанах
`tan\(x deg\)` тангенс в градусах
`tg\(x rad\)` або `tg\(x\)` тангенс в радіанах
`tg\(x deg\)` тангенс в градусах
`cot\(x rad\)` або `cot\(x\)` котангенс в радіанах
`cot\(x deg\)` котангенс в градусах
`ctg\(x rad\)` або `ctg\(x\)` котангенс в радіанах
`ctg\(x deg\)` котангенс в градусах

`asin\(x\)` арксинус
`acos\(x\)` арккосинус
`atan\(x\)` або `atg\(x\)` арктангенс
`acot\(x\)` або `actg\(x\)` арккотангенс

`exp\(x\)` експонента, число е ^ х 
`log2\(x\)` логарифм за основою 2
`log10\(x\)` логарифм за основою 10
`lg\(x\)` також логарифм за основою 10 
`log`\(x, y\) логарифм із довільною основою , де x\-аргумент,  y\-основа

/compare порівняння вигідності двох товарів, опираючись на вагу і ціну\.
Вводиться в порядку вага1/об'єм1 ціна1 вага2/об'єм2 ціна2\.
Вага і ціна мають бути в однакових величинах\.
По дефолту стоять грами/мілілітри і гривні \(/compare 65 4\.50 280 20\.40\)
'''

new_to_add = '''
\#\#`deg` перетворення радіанів у градуси
\#\#`rad` перетворення градусів у радіани
\#\#`loge` логарифм із основою число е 
\#\#`ln` також логарифм із основою число 
'''
